
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДобавитьИзСпискаЗадачНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьИзСпискаЗадачНаСервере()
	
	//СоздатьТаблицуЗначений(ТЗ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Заказ.Ссылка КАК Ссылка,
	|	Заказ.Номер КАК Номер,
	|	Заказ.ФИО_клиента КАК ФИО_клиента,
	|	Заказ.ИтоговаяСумма КАК ИтоговаяСумма,
	|	Заказ.Телефон КАК Телефон,
	|	Заказ.Товары.(
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество
	|	) КАК Товары
	|ИЗ
	|	Документ.Заказ КАК Заказ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка = Таблица.Добавить();
		Строка.Номер = Выборка.Номер;
	

		Строка.Сдача = Выборка.Сдача;
		Строка.Сумма = Выборка.ИтоговаяСумма;
		Строка.Галка = ложь;
	КонецЦикла;
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПодтвердитьВыбор(Команда)
	//Ключ = ПолучитьИзВременногоХранилища(ЭтотОбъект.ФормаДокумента.АдресВХранилище);
		ФормаДока = ПолучитьФорму("Документ.МаршрутныйЛист.Форма.ФормаДокумента");
	Для Каждого Строка Из Таблица Цикл
		Если Строка.Галка = Истина тогда
			НоваяСтрока = ФормаДока.Объект.СписокЗадач.Добавить();	
			НоваяСтрока.Время = Строка.Дата;
			НоваяСтрока.Адрес =  Строка.Адрес;
			//НоваяСтрока.Клиент = Задача.ФИО_клиента1;
			НоваяСтрока.Сдача =  Строка.Сдача;
			//НоваяСтрока.СпособОплаты =  Задача.СпособОплаты;
			НоваяСтрока.Сумма = Строка.Сумма;
		КонецЕсли;
	КонецЦикла;
	

	ЭтаФорма.Закрыть();
	ФормаДока.Открыть();
КонецПроцедуры





