&НаКлиенте
Процедура РассчетСуммы(Элемент,Объект) Экспорт
	Строка = Объект.Товары.ТекущиеДанные;
	Строка.Сумма = Строка.Количество*Строка.ЦенаЕденицы;	
КонецПроцедуры

&НаСервере 
Процедура УзнатьЦенуТовара(Номенклатура,Цена,ТребуемоеЗначение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.РозничнаяЦена КАК Цена,
	|	Номенклатура.ЗакупочнаяЦена КАК ЗакупочнаяЦена
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Строка(Номенклатура));
	
	Результат = Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() цикл
	//	
	//КонецЦикла;
	Пока Результат.Следующий() Цикл
		Если ТребуемоеЗначение = "Закупочная" тогда
		Цена = Результат.ЗакупочнаяЦена;
		Прервать;
	КонецЕсли;
	
		Если ТребуемоеЗначение = "Розничная"  тогда
			Цена = Результат.Цена;
		КонецЕсли;
				Сообщить(Строка(Результат.Цена));
	КонецЦикла;
КонецПроцедуры


