&НаКлиенте
Процедура РассчетСуммы(Элемент,Объект) Экспорт
	Строка = Объект.Товары.ТекущиеДанные;
	Строка.Сумма = Строка.Количество*Строка.ЦенаЕдиницы;	
КонецПроцедуры

&НаСервере 
Процедура УзнатьЦенуТовара(Номенклатура,Цена,ТребуемоеЗначение) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Наименование КАК Наименование,
	|	ЦеныНоменклатурыСрезПоследних.ЗакупочнаяЦена КАК ЗакупочнаяЦена,
	|	ЦеныНоменклатурыСрезПоследних.РозничнаяЦена КАК РозничнаяЦена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|ГДЕ
	|	ЦеныНоменклатурыСрезПоследних.Наименование = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.НайтиПоНаименованию(Строка(Номенклатура)));
	
	Результат = Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() цикл
	//	
	//КонецЦикла;
	Пока Результат.Следующий() Цикл
		Если ТребуемоеЗначение = "Закупочная" тогда
		Цена = Результат.ЗакупочнаяЦена;
		Прервать;
	КонецЕсли;
	
		Если ТребуемоеЗначение = "Розничная"  тогда
			Цена = Результат.РозничнаяЦена;
		КонецЕсли;
				//Сообщить(Строка(Цена));
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПроверитьДублиНоменклатуры(Номенклатура,ТабличнаяЧасть)
	Для каждого строка из ТабличнаяЧасть Цикл
		Если Строка(строка.Номенклатура) = Номенклатура тогда
			Сообщить("Опаньки, вы обосрались! Напишите другую номенклатуру");
	КонецЕсли;
	КонецЦикла;
КонецПроцедуры


