
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДобавитьИзСпискаЗадачНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьИзСпискаЗадачНаСервере()
	
	//СоздатьТаблицуЗначений(ТЗ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачаКурьеру.Ссылка КАК Ссылка,
	|	ЗадачаКурьеру.Номер КАК Номер,
	|	ЗадачаКурьеру.Дата КАК Дата,
	|	ЗадачаКурьеру.ФИО_клиента1 КАК ФИО_клиента1,
	|	ЗадачаКурьеру.ИтоговаяСумма1 КАК ИтоговаяСумма,
	|	ЗадачаКурьеру.Телефон1 КАК Телефон,
	|	ЗадачаКурьеру.АдресДоставки1 КАК Адрес,
	|	ЗадачаКурьеру.ДатаИВремяДоставки1 КАК ДатаИВремяДоставки,
	|	ЗадачаКурьеру.СдачаДляКурьеров1 КАК Сдача,
	|	ЗадачаКурьеру.Доставлено КАК Доставлено,
	|	ЗадачаКурьеру.ВОбработке КАК ВОбработке,
	|	ЗадачаКурьеру.СпособОплаты КАК СпособОплаты
	|ИЗ
	|	Документ.ЗадачаКурьеру КАК ЗадачаКурьеру
	|ГДЕ
	|	ЗадачаКурьеру.Доставлено = ЛОЖЬ
	|	И ЗадачаКурьеру.ВОбработке = ЛОЖЬ
	|	И ЗадачаКурьеру.Проведен = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка = Таблица.Добавить();
		Строка.Номер = Выборка.Номер;
		Строка.Дата = Выборка.ДатаИВремяДоставки;
		Строка.Адрес = Выборка.Адрес;
		Строка.Сдача = Выборка.Сдача;
		Строка.Сумма = Выборка.ИтоговаяСумма;
		Строка.Галка = ложь;
	КонецЦикла;
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПодтвердитьВыбор(Команда)
	//Ключ = ПолучитьИзВременногоХранилища(ЭтотОбъект.ФормаДокумента.АдресВХранилище);
		ФормаДока = ПолучитьФорму("Документ.МаршрутныйЛист.Форма.ФормаДокумента");
	Для Каждого Строка Из Таблица Цикл
		Если Строка.Галка = Истина тогда
			НоваяСтрока = ФормаДока.Объект.СписокЗадач.Добавить();	
			НоваяСтрока.Время = Строка.Дата;
			НоваяСтрока.Адрес =  Строка.Адрес;
			//НоваяСтрока.Клиент = Задача.ФИО_клиента1;
			НоваяСтрока.Сдача =  Строка.Сдача;
			//НоваяСтрока.СпособОплаты =  Задача.СпособОплаты;
			НоваяСтрока.Сумма = Строка.Сумма;
		КонецЕсли;
	КонецЦикла;
	

	ЭтаФорма.Закрыть();
	ФормаДока.Открыть();
КонецПроцедуры





