&НаСервере
Процедура ПроверкаОстатков(Номенклатура) Экспорт
Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВНаличииОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВНаличииОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыВНаличии.Остатки КАК ТоварыВНаличииОстатки
	|ГДЕ
	|	ТоварыВНаличииОстатки.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Строка(Номенклатура));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.КоличествоОстаток<=0 тогда 
			Сообщить("Номенклатуры нет в наличии");
		КонецЕсли
	КонецЦикла;
КонецПроцедуры