&НаКлиенте
Процедура РассчетСуммыПоНоменклатуре(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	Строка.Сумма = Строка.Количество*Строка.ЗакупочнаяЦена;	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореНоменклатуры(Элемент,Текст, ВыбранноеЗначение, СтандартнаяОбработка)
	Номенклатура = Текст;
	Цена = NULL;
	ОбращениеКОбщемуМодулю(Номенклатура, Цена); 
	Строка = Элементы.Товары.ТекущиеДанные; 
	Строка.ЗакупочнаяЦена = Цена; 
КонецПроцедуры

&НаСервере
Процедура ОбращениеКОбщемуМодулю(Номенклатура, Цена)
	ТребуемоеЗначение = "Закупочная";
	УзнатьЦенуТовара(Номенклатура,Цена,ТребуемоеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ПриРучномИзмененииЗакупочнойЦены(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Строка = Элементы.Товары.ТекущиеДанные;
	Номенклатура = Строка.Номенклатура;	Цена = NULL;
	СравнениеЦен(Номенклатура,Цена);
	
	Если Число(Текст)>Цена тогда
		Форма = ПолучитьФорму("Документ.ПриходнаяНакладная.Форма.ПроЗакупочнуюЦену");
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СравнениеЦен(Номенклатура,Цена)
	ТребуемоеЗначение = "Розничная";
	УзнатьЦенуТовара(Номенклатура,Цена,ТребуемоеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Итог = 0;
	Для каждого элемент из Объект.Товары Цикл
		Сумма = Элемент.Сумма;
		Итог = Сумма+Итог;	
		
	КонецЦикла;
	
	
	Объект.ИтоговаяСумма = Итог;	
	Итог = 0
КонецПроцедуры
