
Перем РезультатПроверки;
Перем КоличествоНоменклатуры;

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Итог = 0;
	Для каждого элемент из Объект.Товары Цикл
		Сумма = Элемент.Сумма;
		Итог = Сумма+Итог;	
		
	КонецЦикла;
	
	
	Объект.ИтоговаяСумма = Итог;	
	Итог = 0
КонецПроцедуры


&НаСервере
Процедура ОбращениеКОбщемуМодулю(Номенклатура, Цена, ТребуемоеЗначение)
	
	
	УзнатьЦенуТовара(Номенклатура,Цена,ТребуемоеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура РаботаСНоменклатурой(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	Номенклатура = Текст;
	Цена = NULL;
	ТребуемоеЗначение = "Розничная";
	
	ОбращениеКОбщемуМодулю(Номенклатура, Цена, ТребуемоеЗначение);
	Строка = Элементы.Товары.ТекущиеДанные;
	Строка.ЦенаЕдиницы = Цена; 
	ТребуемоеЗначение = "Закупочная";
	ОбращениеКОбщемуМодулю(Номенклатура, Цена, ТребуемоеЗначение); 
	Строка.ЗакупочнаяЦена = Цена;
	
	РезультатПроверки = NULL;
	КоличествоНоменклатуры = NULL;
	ПроверкаОстатков.ПроверкаОстатков(Номенклатура,РезультатПроверки,КоличествоНоменклатуры);
	Если РезультатПроверки = NULL или РезультатПроверки = "Нет" тогда
		
		
		ТекстСообщения = "Номенклатуры нет в наличии!Выберите другое наименование";
		Поле="Номенклатура";
		СообщенияОбОшибке(Поле,ТекстСообщения);
		
		Иначе Если РезультатПроверки = "Есть" тогда
			Сообщить(  "В наличии "+КоличествоНоменклатуры+" Штук");
		КонецЕсли;
	КонецЕсли
	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчетСуммНоменклатуры(Элемент)
		
	РезультатПроверки = NULL;
	КоличествоНоменклатуры = NULL;
	

	Строка = Элементы.Товары.ТекущиеДанные;
	ПроверкаОстатков.ПроверкаОстатков(Строка.Номенклатура,РезультатПроверки,КоличествоНоменклатуры);

	Если Строка.Количество > КоличествоНоменклатуры Тогда
				Строка.Количество = NULL;
				
		Текст = "Вы ввели слишком большое количесто товара!На складе в наличии "+КоличествоНоменклатуры+" единицы.";
		Поле="Количество";
		СообщенияОбОшибке(Поле,Текст);

		Иначе
	Строка.Сумма = Строка.Количество*Строка.ЦенаЕдиницы;
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ФИО_клиентаОбработкаВыбораНаСервере(ВыбранноеЗначение,Телефон,Мейл)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Клиенты.Наименование КАК Наименование,
	|	Клиенты.Телефон КАК Телефон,
	|	Клиенты.email КАК email
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Строка(ВыбранноеЗначение));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Мейл = ВыборкаДетальныеЗаписи.email;
		
		Телефон = ВыборкаДетальныеЗаписи.Телефон;
		
		
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФИО_клиентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ФИО = ВыбранноеЗначение;
	Телефон = NULL;
	Мейл = NULL;//Код = ВыбранноеЗначение.Код;
	ФИО_клиентаОбработкаВыбораНаСервере(ВыбранноеЗначение,Телефон,Мейл);
	Объект.Телефон = Телефон;
	Объект.email = Мейл;
	
	
КонецПроцедуры


