	перем ДанныеЗадачи;
	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		
		ОтборПоДоставке = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); //Добавлям отбор
		ОтборПоДоставке.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; //Как будем сравнивать
		ОтборПоДоставке.Использование = Истина; // Устанавливаем галку использованияНовый ПолеКомпоновкиДанных("Номенклатура")
		ОтборПоДоставке.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Доставлено"); //По какому реквизиту будем делать отбор
		ОтборПоДоставке.ПравоеЗначение = Ложь; // И само значение отбора    
		
		ОтборПоОбработке = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); //Добавлям отбор
		ОтборПоОбработке.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; //Как будем сравнивать
		ОтборПоОбработке.Использование = Истина; // Устанавливаем галку использованияНовый ПолеКомпоновкиДанных("Номенклатура")
		ОтборПоОбработке.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВОбработке"); //По какому реквизиту будем делать отбор
		ОтборПоОбработке.ПравоеЗначение = Ложь; // И само значение отбора    
		
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура Создать(Команда)
		парам = Null;
		ВыделенныеСтрочки = Элементы.Список.ВыделенныеСтроки;
		ПолучитьЭлементы(ВыделенныеСтрочки,парам);
		
		Форма = ПолучитьФорму("Документ.МаршрутныйЛист.ФормаОбъекта",парам);
		Форма.Открыть();
	КонецПроцедуры
	
	
	&НаСервереБезКонтекста
	Процедура ПолучитьЭлементы(ВыделенныеСтрочки,парам) 
		
		
		МаршрутныйЛист = Документы.МаршрутныйЛист.СоздатьДокумент();
		
	
		
		Для Каждого Строка Из ВыделенныеСтрочки Цикл
			Задача = Строка.ПолучитьОбъект();
			//Сообщить(Задача.СпособОплаты);
			//ДанныеЗадачи = Новый Структура("Название,Дата,Адрес,СпособОплаты,Сдача,Клиент", 
			//Задача.Ссылка,Задача.ДатаИВремяДоставки1,Задача.АдресДоставки1, 
			//Задача.СпособОплаты,Задача.СдачаДляКурьеров1,Задача.ФИО_клиента1);
			
			НоваяСтрока = МаршрутныйЛист.СписокЗадач.Добавить();	
			НоваяСтрока.Время = Задача.ДатаИВремяДоставки1;
			НоваяСтрока.Адрес =  Задача.АдресДоставки1;
			НоваяСтрока.Клиент = Задача.ФИО_клиента1;
			НоваяСтрока.Сдача =  Задача.СдачаДляКурьеров1;
			НоваяСтрока.СпособОплаты =  Задача.СпособОплаты;
			НоваяСтрока.Сумма = Задача.ИтоговаяСумма1;
			
			
		КонецЦикла;
		
	
		МаршрутныйЛист.Дата = ТекущаяДата();
		МаршрутныйЛист.Записать();

		СсылкаНаДок = МаршрутныйЛист.Ссылка;
		
		парам = новый Структура;
		парам.вставить("Ключ",СсылкаНаДок);
		КонецПроцедуры
	
